 
<html>
<!-- #BeginTemplate "/Templates/dtvnormal-multilang.dwt" --> 
<head>
<!-- #BeginEditable "doctitle" --> 
<title>DScaler - Foire Aux Questions</title>
<!-- #EndEditable --> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
p {  font-family: Arial, Helvetica, sans-serif; font-size: 10pt}
.bottommenu {  font-family: Arial, Helvetica, sans-serif; font-size: 8pt; font-style: normal; text-decoration: none}
h3 {  font-family: Arial, Helvetica, sans-serif; font-size: 10pt; font-style: normal; font-weight: bold}
h1 {  font-family: Verdana, Arial, Helvetica, sans-serif; font-size: 18pt; font-weight: bold}
li {  font-family: Arial, Helvetica, sans-serif; font-size: 10pt}
h2 {  font-family: Arial, Helvetica, sans-serif; font-size: 14pt; font-weight: bold}
ol {  font-family: Arial, Helvetica, sans-serif; font-size: 10pt}
blockquote {  font-family: Arial, Helvetica, sans-serif; font-size: 10pt}
pre {  font-family: "Courier New", Courier, mono; font-size: 9pt}
ul {  font-family: Arial, Helvetica, sans-serif; font-size: 10pt}
-->
</style>
</head>
<body bgcolor="#FFFFFF">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td height="1" width="160"><img src="../images/spacer.gif" width="1" height="1"></td>
    <td height="1" width="342"><img src="../images/spacer.gif" width="1" height="1"></td>
    <td height="1" width="501"><img src="../images/spacer.gif" width="1" height="1"></td>
  </tr>
  <tr> 
    <td width="160" rowspan="2"><img src="../images/dscalerlogo.jpg" alt="DScaler logo"></td>
    <td colspan="2" align="right" valign="top"> <font face="Verdana, Arial, Helvetica, sans-serif" size="5"><b><font size="1"><!-- #BeginEditable "Language%20Selector" --><font face="Verdana, Arial, Helvetica, sans-serif" size="5"><a href="../FAQ.htm"><img src="../images/selector-english.gif" width="45" height="18" border="0"></a><img src="../images/selector-divider.gif" width="10" height="17"><b><font size="1"><font face="Verdana, Arial, Helvetica, sans-serif" size="5"><a href="../portuguese/PortugueseFAQ.htm"><img src="../images/selector-portuguese.gif" width="60" height="18" border="0"></a><img src="../images/selector-divider.gif" width="10" height="17"></font></font></b><b><font size="1"><font face="Verdana, Arial, Helvetica, sans-serif" size="5"><b><font size="1"><font face="Verdana, Arial, Helvetica, sans-serif" size="5"><a href="../russian/FAQ.htm"><img src="../images/selector-russian.gif" width="45" height="18" border="0"></a><img src="../images/selector-divider.gif" width="10" height="17"></font></font></b><a href="FAQ.htm"></a></font></font></b><img src="../images/selector-french.gif" width="50" height="18" border="0"></font><!-- #EndEditable --></font></b></font></td>
  </tr>
  <tr> 
    <td colspan="2" align="right" valign="bottom"><font face="Verdana, Arial, Helvetica, sans-serif" size="5"><b><!-- #BeginEditable "Page%20Title" -->FAQ<!-- #EndEditable -->&nbsp;</b></font></td>
  </tr>
  <tr bgcolor="#FFCC00" align="right"> 
    <td colspan="3"><img src="../images/yellowspacer.gif" width="100%" height="2"></td>
  </tr>
  <tr> 
    <td colspan="3">&nbsp;</td>
  </tr>
  <tr> 
    <td colspan="3"><!-- #BeginEditable "Text" --> 
      <h1>Introduction</h1>
      <p> 
      <h2>Qu'est ce que DScaler ?</h2>
      <p> DScaler est une application qui capture une source analogique entrelacée, 
        la désentrelace afin de générer un flux d'images progressives, &agrave; 
        la r&eacute;solution d&eacute;sir&eacute;e, en vue d'une utilisation sur 
        un moniteur informatique ou sur un projecteur. 
      <p> Les sources analogiques entrelacées sont ce que génèrent des appareils 
        comme les magnétoscopes, les laserdisc ou les consoles de jeux. 
      <p> 
      <p> 
      <h2>Qu'est ce que DScaler a de si spécial ?</h2>
      <p> Contrairement à la plupart des applications comparables, DScaler implémente 
        des algorithmes évolués afin de désentrelacer ces sources. L'utilisation 
        de ces algorithmes permet de s'assurer que chaque type de source sera 
        traitée de la meilleure manière possible.<br>
        La qualité d'image obtenue n'avait encore été jamais vu auparavant sur 
        un micro-ordinateur. 
      <p> Parmi ces techniques ; 
      <ul>
        <li>désentrelacement de sources vidéo (non film) 
        <li>détection du procédé de "telecinema" inverse 
        <li>la détection, pour les sources film, des séquencements 2:2 (pal) et 
          3:2 (ntsc). En Anglais, le "3:2 pulldown" 
      </ul>
      <p> Une grande qualité d'image résulte de ces opérations complexes. Ceci 
        permet à certaines personnes équipées de projecteurs dits "compatibles 
        doubleur", de leur fournir une image progressive à partir d'une source 
        entrelacée. 
      <p> 
      <h2>Qu'est ce que dTV ?</h2>
      <p>dTV est l'ancien nom de DScaler. Nous avons chang&eacute; ce nom car 
        il commencait &agrave; &ecirc;tre utilis&eacute; en r&eacute;f&eacute;rence 
        &agrave; la t&eacute;l&eacute;vision num&eacute;rique (Digital TeleVision) 
        et provoquait de la confusion dans les forums. Dans le code source et 
        sur le site, vous trouverez encore certainement de veilles r&eacute;f&eacute;rences 
        &agrave; l'ancien nom mais nous vous conseillons d'utiliser dor&eacute;navant 
        ce nouveau nom. </p>
      <h2>Historique de DScaler</h2>
      <p>Tout a commenc&eacute; en juillet 2000. En introduction, le post de Cliff 
        Watson pr&eacute;sentant un historique du pchc dans &quot;<a href="http://www.avsforum.com/ubb/Forum12/HTML/012706.html#7">Who 
        are the pioneers of htpc ?</a>&quot;. Ali, l'un des premiers adeptes du 
        pchc, faisait la l'&eacute;loge d'une application ; <a href="http://www.borgtech.org/">BorgTV</a> 
        (ou bTV) qui lui permettait de d&eacute;sentrelacer certaines sources 
        analogiques avec un niveau de qualit&eacute; jamais atteint. Gr&acirc;ce 
        ) certains posts comme &quot;<a href="http://www.avsforum.com/ubb/Archives/Archive-000004/HTML/20010102-12-002950.html">Not 
        so bad analog video deinterlacing with htpc</a>&quot;, un certain nombre 
        de personnes se sont int&eacute;ress&eacute;es au sujet. Parmi elles ; 
        <a href="../Authors.htm">John Adcock</a>.</p>
      <p>Il publia un plugin pour bTV qui permettait de d&eacute;sentrelacer suivant 
        le mod&egrave;le 2:2 des films PAL. Ceci permis de montrer que le d&eacute;sentrelacement 
        de telles sources &eacute;tait possible sans l'assistance de mat&eacute;riel 
        (voir &quot;<a href="http://www.avsforum.com/ubb/Archives/Archive-000004/HTML/20010102-12-003461.html">John 
        Adock's great PALMovie plugin</a>&quot;).</p>
      <p>Le manque de support du format NTSC dans bTV rendait l'im&eacute;plementation 
        du complexe algorithme de s&eacute;quencement 3:2 a oblig&eacute; John 
        a &eacute;crire sa propre application bas&eacute;e sur Multidec. Son nom, 
        bas&eacute; sur l'application d'ou il a pris son inspiration ; dTV (voir 
        &quot;<a href="http://www.avsforum.com/ubb/Archives/Archive-000004/HTML/20010714-12-003790.html">First 
        Version of NTSC/PAL TV deinterlacing program</a>&quot;).</p>
      <p>Les premi&egrave;res versions ne poss&eacute;daient qu'un m&eacute;canisme 
        de s&eacute;lection manuelle de l'algorithme de d&eacute;sentrelacement. 
        La perc&eacute;e suivante fut l'impl&eacute;mentation par John de l'algorithme 
        de s&eacute;quencement 3:2 de Mark Rejhon.</p>
      <p>Ceci apporta la preuve que de telles techniques complexes de d&eacute;sentrelacement 
        &eacute;tait faisables en temps r&eacute;el et sans l'ajout de mat&eacute;riel 
        d&eacute;di&eacute;. Depuis lors, de plus en plus d'utilisateurs (et de 
        dev&eacute;loppeurs) ont rejoint les rangs de dTV et l'utilisent dans 
        leur pchc plut&ocirc;t que d'utiliser un doubleur externe.</p>
      <p>En mai 2001, <a href="http://www.avsforum.com/ubb/Forum12/HTML/010323.html">dTV 
        a &eacute;t&eacute; renomm&eacute; en DScaler</a> afin d'&eacute;viter 
        toute confusion avec la t&eacute;l&eacute;vision num&eacute;rique (en 
        Anglais, Digital TeleVision ; DTV) qui prenait alors de plus en plus d'ampleur.</p>
      <p>Voyez le fichier <a href="../Authors.htm">Auteurs</a> pour la liste des 
        principaux d&eacute;veloppeurs ainsi que la liste des <a href="../Thanks.htm">remerciements</a> 
        pour quelques noms de personnes qui contribuent au succ&egrave;s de DScaler.</p>
      <h2>Combien co&ucirc;te DScaler ?</h2>
      <p>DScaler est un logiciel gratuit, d&eacute;velopp&eacute; dans un cadre 
        &quot;open-source&quot;, et prot&eacute;g&eacute; par la <a href="http://www.april.org/gnu/gpl_french.html">license 
        GNU GPL</a>.</p>
      <h2>Que puis-je faire si je d&eacute;sire contribuer financi&egrave;rement 
        &agrave; DScaler ?</h2>
      <p>Sans obligation aucune, nous vous sugg&eacute;rons de supporter l'organisme 
        &quot;<a href="http://www.eff.org/">Electronic Frontier Foundation</a>&quot; 
        en leur apportant votre contribution via ce <a href="http://www.eff.org/support/">formulaire</a>.</p>
      <h2>Ou puis-je t&eacute;l&eacute;charger DScaler ?</h2>
      <p>Sur le site de DScaler, dans la page de <a href="http://www.dscaler.org/downloads.htm">t&eacute;l&eacute;chargement</a>.</p>
      <p>De temps en temps, les d&eacute;veloppeurs construisent des versions 
        interm&eacute;diaires de test. Celles-ci sont souvent instables mais contiennent 
        les derniers d&eacute;veloppements. Ces versions ne sont pas recommend&eacute;es 
        et ne seront support&eacute;es que via la <a href="http://sourceforge.net/mail/?group_id=7420">mailing 
        list de d&eacute;veloppement</a>. Ces versions se trouvent <a href="http://sourceforge.net/project/showfiles.php?group_id=7420">ici</a>.</p>
      <h2>Puis je livrer DScaler sur des machines que je fabrique ?<br>
        Puis je redistribuer DScaler ?</h2>
      <p>DScaler est prot&eacute;g&eacute; par la license <a href="http://www.april.org/gnu/gpl_french.html">GNU 
        GPL</a>. A ce titre, vous &ecirc;tes libres de redistribuer DScaler dans 
        la mesure ou vous acceptez de redistribuer &eacute;galement le code source. 
        <b>Un simple lien vers notre site n'est pas suffisant ! </b>Egalement, 
        il serait courtois d'&eacute;tablir un <a href="mailto:deinterlace-discuss@lists.sourceforge.net">contact</a> 
        avec les gens qui redistribuent notre produit. Nous pouvons ainsi ajouter 
        une r&eacute;f&eacute;rence &agrave; votre site sur le n&ocirc;tre et 
        savoir un peu mieux qui utilise notre produit.</p>
      <p>&nbsp;</p>
      <p> 
      <p> 
      <h1>Points généraux</h1>
      <p> 
      <p> 
      <h2>Devrais je utiliser DScaler pour désentrelacer l'image fournie par mon 
        lecteur de dvd de salon ?</h2>
      <p> Bien que celà soit faisable et fonctionne plutôt correctement (voir 
        la section "DScaler/Windvd challenge" sur la <a href="/screenshots/index.htm">page 
        des captures d'écrans</a>), les pc home cinéma ont montré les meilleurs 
        résultats grâce à la combinaison des applications de lecteur des dvd, 
        d'un lecteur de dvd-rom, et d'une carte graphique récente.<br>
        Cependant, cette possibilité a souvent été utilisée à des fins de tests 
        (test de la qualité de capture sur une source de grande qualité, test 
        des techniques de séquencement sur des sources correctement encodées etc..). 
      <p> 
      <h1>Questions de soft</h1>
      <p> 
      <h2>Sur quel système d'exploitation puis je utiliser DScaler ?</h2>
      <p> Windows 95 ok, driver VxD fonctionnant au niveau du &quot;ring-0&quot;, 
        Internet Explorer probablement requis<br>
        Windows 98 ok, driver VxD fonctionnant au niveau du &quot;ring-0&quot;<br>
        Windows NT ?? besoin &eacute;ventuel d'une update de DirectX 5<br>
        Windows Me ok, driver VxD fonctionnant au niveau du &quot;ring-0&quot;<br>
        Windows 2000 ok, driver &quot;sys&quot; fonctionnant au niveau du &quot;ring-0&quot;<br>
        Linux non, mais si vous voulez travailler au portage, <a href="#HELP">contactez 
        nous</a><br>
        OS/2 definitivement non ;-) 
      <h2>En quoi consistent tous ces algorithmes de d&eacute;sentrelacement ?</h2>
      <p>Vous trouverez une description d&eacute;taill&eacute;e de ceux ci dans 
        <a href="Help/Deinterlace.HTM">l'aide en ligne</a>.
      <p> 
      <h2>Puis je contrôler à distance DScaler ? <b>OUI</b></h2>
      <p> Absolument. DScaler a été développé principalement par des personnes 
        cherchant à l'utiliser pour désentrelacer les sources analogiques pour 
        les utiliser sur un projecteur. Il va de soi qu'ils préferent utiliser 
        DScaler depuis leur télécommande, sur leur canapé, qu'assis à leur bureau.<br>
        Dans ce but, DScaler est rempli de <a href="keyboard.htm">raccourcis claviers</a> 
        pour la plupart des opérations courantes afin de faciliter sa manipulation.<br>
        Nous suggérons l'usage de <a href="http://www.girder.nl">Girder</a> de 
        Ron Bessems comme solution de choix pour contrôler à distance son ordinateur. 
      <p>Un fichier de configuration pour contr&ocirc;ler DScaler avec Girder 
        est disponible <a href="http://www.girder.nl/download.php?Link=172">ici</a>.
      <p> 
      <h1>Questions de matériel</h1>
      <p> 
      <h2>Puis je utiliser n'importe quelle carte vga ?</h2>
      <p> Malgré ce commentaire de Mark Rejhon ; 
      <p> <i>"DScaler requires an AGP card. It is impossible to do on a PCI video 
        card. DScaler uses massive amounts of *bidirectional* bus bandwidth: 250 
        megabits per second incoming bandwidth (from TV card) and about 500 megabits 
        per second outgoing bandwidth (to videocard). This bus data firehose is 
        not feasible on PCI bus, as PCI can reliably continuously transfer up 
        to about 600-700 megabits per second *in one direction only* out of a 
        possible 1056 megabits per second (132 megabytes per second) due to overhead. 
        Try to go bidirectional, and framerate literally gets the death penalty!"</i> 
      <p> Malgré tout, l'expérience depuis quelques mois semble montrer que même 
        l'usage de cartes pci semble convenir sans pour autant induire de ralentissements.<br>
        Dans certains cas cependant, le taux de rafraîchissement chute au fur 
        et à mesure que l'on grimpe en résolution ; 
      <p> IanD nous a dit <i>"I have an 8MB 3dfusion PCI on a BX mobo Celeron 
        566 64MB RAM 66MHz FSB, with Dynalink Magic TView (Conexant 878) and can 
        only execute DScaler at 16 bit colour depth. When running a 1024x768 desktop, 
        DScaler v1.9 with a 720x576 @ 50Hz PAL composite input gives 0 DFS in 
        manual Video De-interlace mode for DScaler window sizes up to 848x629 
        (as determined from DScaler.ini) but 7+ DFS for window sizes even 1 pixel 
        above either of these dimensions"</i> 
      <p> Conclusion ; pas de prérequis spécifiques pour DScaler. Il fonctionne 
        certainement correctement avec n'importe quelle carte. Cependant, au jour 
        d'aujourd'hui, les cartes à base de GeForce ou les Matrox G4x0 (dualhead) 
        sont utilisées avec succès par de nombreux utilisateurs. 
      <p> <a name="BESTCARD"></a> 
      <h2>Quelle carte de capture puis je utiliser ?</h2>
      <p> Pratiquement n'importe quelle carte (ce qui signifie BEAUCOUP de cartes) 
        basée sur un des chipset dévelopés par Conexant (précédemment Brooktree) 
        bt848/878/879. Pourquoi ceux ci ? Ils sont, depuis plusieurs années, parmi 
        les chipset les plus simples à programmer (énormément d'applications ont 
        été développées pour ceux ci) et les moins chers. Ce qui signifie qu'un 
        grand nombre de sociétés ont fabriqué des cartes sur ce modèle. 
      <p>Le son depuis le tuner ne fonctionne pas syst&eacute;matiquement, et 
        le support de l'ensemble des combinaisons de cartes et de tuner n'est 
        pas une priorit&eacute;. 
      <p> Malgré le fait que nous sommes assez incapables de vous dire quelles 
        cartes sont les meilleures, voici une petite sélection de cartes qui sont 
        utilisées avec succès par un certain nombre d'utilisateurs ; 
      <p> 
      <ul>
        <li>Zoltrix Genie TV <a href="http://www.zoltrix-int.com/products/video/8MMZXGENIE.htm">http://www.zoltrix-int.com/products/video/8MMZXGENIE.htm</a> 
        <li>The WinTV series from Hauppage <a href="http://www.hauppage.com/html/products.htm">http://www.hauppage.com/html/products.htm</a> 
        <li>Guillemot maxi video 3 <a href="http://fr.guillemot.com/brand/gamme/video/mtvvidp3/mtvvidpci3.html">http://fr.guillemot.com/brand/gamme/video/mtvvidp3/mtvvidpci3.html</a> 
        <li>The Pinacle Studio PCTV <a href="http://www.pinnaclesys.com/ProductPage.asp?Product_ID=6">http://www.pinnaclesys.com/ProductPage.asp?Product_ID=6</a> 
      </ul>
      Jetez un oeil a la page des <a href="/card-support/index.htm">cartes supportées</a>. 
      Elle ne sera évidemment jamais complète alors n'hésitez pas à nous contacter 
      pour nous faire part de votre expérience avec telle ou telle carte. 
      <p> <i>cette liste est initialement basée sur celle associée au driver linux 
        bttv sur lequel ce programme était originellement basé.</i> 
      <p> 
      <h2>Puis je utiliser l'entrée video de la carte "X" ?</h2>
      <p> Probablement non. DScaler supporte (voir section précédente) les chipsets 
        Brooktree/Conexant. Le fait de supporter d'autres chipsets, bien que faisable, 
        requiert beaucoup de travail et de solides connaissances de ceux ci. Et 
        malheureusement, <b>aucune carte récente avec une entrée vidéo n'utilise 
        les chipsets Brooktree/Conexant</b>. Ce qui signifie que les cartes Matrox, 
        Asus Deluxe etc.. ne sont pas supportées. 
      <p> 
      <h2>Puis je utiliser plus d'une entrée video à la fois ?</h2>
      <p> Certaines personnes un peu "farfelues" (elle l'admettent elles-mêmes 
        :-) qui utilise la fonction "image dans l'image" de certains téléviseurs, 
        ont posé la question suivante ; est ce que DScaler est capable de gérer 
        de multiples cartes ou de multiples entrées vidéo ?<br>
        Une carte permettant, au minimum, 4 entrées vidéo &eacute;tait fabriquée 
        par Leadtek. Il s'agissait de la Winview 605. 
      <p> Elle est basée sur le bon chipset, il est donc possible qu'elle fonctionne 
        avec DScaler, mais rien n'a été tenté au jour d'aujourd'hui pour traiter 
        plusieurs entrées vidéo simultanément. 
      <p> Jetez un oeil sur l'article suivant sur <a href="http://www.avsforum.com/ubb/Archives/Archive-000004/HTML/20010323-12-004431.html">AVS 
        Forum</a>. 
      <p> <a name="TROUBLE"></a> 
      <h1>Problèmes ?</h1>
      <p> <a name="PURPLESTRIPES"></a> 
      <h2>En quoi consiste ce problème des lignes roses/violettes ?</h2>
      <p> Lorsque l'on utilise certaines sources analogiques avec certaines cartes 
        et DScaler, il apparaît de nombreuses lignes horizontales roses sur l'image. 
      <p> <a href="../images/Mummy_MacrovisionOn.jpg">Cette image</a> contient 
        un signal macrovision. La même séquence vidéo <a href="../images/Mummy_MacrovisionOff.jpg">sans 
        la protection macrovision</a> ne contient aucune ligne. 
      <p> Ce phénomène semble être, au moins, <b>plus visible en présence d'un 
        signal vidéo protégé par macrovision</b> mais le phénomène a été vu (bien 
        que moins prononcé) sur des sources non protégées. 
      <p> D'autres exemples de ce phénomène sont disponibles dans les articles 
        suivantes ;<br>
        <a href="http://www.avsforum.com/ubb/Archives/Archive-000004/HTML/20010323-12-004317.html">avs:MacroVision 
        side effect</a><br>
        <a href="http://www.avsforum.com/ubb/Forum12/HTML/004436.html">avs:DScaler 
        Purple Stripes - is this capture card dependent?</a> 
      <p> Un extrait de la <a href="http://www.dvddemystified.com/dvdfaq.html">Faq 
        du dvd</a> ; 
      <p> <i>"Macrovision adds a rapidly modulated colorburst signal ("Colorstripe") 
        along with pulses in the vertical blanking signal ("AGC") to the composite 
        video and s-video outputs. This confuses the synchronization and automatic-recording-level 
        circuitry in 95% of consumer VCRs. Unfortunately, it can degrade the picture, 
        especially with old or nonstandard equipment. Macrovision may show up 
        as stripes of color, distortion, rolling, black & white picture, and dark/light 
        cycling. Macrovision creates problems for many line doublers."</i> 
      <p> <b>ATTENTION</b> En pratique, ce problème n'a été observé uniquement 
        lors du branchement, à des fins de tests, d'un lecteur de dvd de salon 
        à l'ordinateur. Il n'est pas démontré que le problème se pose également 
        avec d'autres types de sources. Dans la plupart des cas, vous n'avez donc 
        pas à vous en soucier 
      <p> 
      <h2>DScaler semble ne pas parvenir à tenir le rhytme (DFS &gt; 0)</h2>
      <p></p>
      Certaines personnes ont observés des trames perdues (NDT ; l'indicateur 
      DFS, Dropped Frames per Second en bas à droite de la barre de status) (ce 
      qui est généralement le signe d'une machine qui n'arrive pas à tenir la 
      charge imposé par DScaler) sur des systèmes pourtant très puissants. Une 
      hypothèse suggère des problèmes de vitesse du bus agp sur certaines cartes 
      mères. 
      <p> JackB nous dit à ce sujet <i>"We looked at his BIOS settings and the 
        only major difference is that his had a 4X AGP mode and my MB only has 
        a 2X AGP mode <snip>We put my video card, a GeForce2 MX, in his(slower 
        supposedly)system and it ran 0 DFS. So it's not the MX throughput that's 
        the problem. So, I'm down to it's my motherboard not being up to speed 
        in either AGP acceleration or I have some settings set incorrectly"</i> 
      <p> <a name="OVERLAY"></a> 
      <h2>J'ai une erreur "overlay update"</h2>
      <p> Parfois, on obtient ce genre de message d'erreur 
      <p><code>Error calling overlay update. D:/source/deinterlace/DScaler/other.c 
        at line 161</code> 
      <p> Nous n'avons malheureusement pas d'explication valable à ce problème 
        mais il apparaît généralement lorsqu'on modifie la taille de la fenêtre 
        de DScaler, ou lorsqu'on le fait passer du mode fenêtre au mode plein 
        écran. Le nombre de couleurs, la fréquence de rafraîchissement ainsi que 
        la taille du bureau Windows ont peut être une influence sur ce problème. 
      <h2>Qu'est ce que le fichier &quot;crashlog.txt&quot;, et ou puis-je le 
        trouver ?</h2>
      <p>Si l'un des d&eacute;veloppeurs vous demande le fichier crashlog.txt, 
        vous devriez le trouver dans le r&eacute;pertoire ou DScaler a &eacute;t&eacute; 
        install&eacute;. Il contient des informations utiles qui peuvent &ecirc;tre 
        utilis&eacute;es pour localiser plus facilement certains bugs. Si vous 
        n'en trouvez pas, ne vous inqui&eacute;tez pas ; informez le d&eacute;veloppeur 
        qu'il n'y en a pas. Enfin, si vous avez ce fichier mais n'observez pas 
        de probl&egrave;mes, vous pouvez l'ignorer sans soucis. 
      <p><br>
      <p><a name="HELP"></a> 
      <h1>Comment puis je contribuer ?</h1>
      <p> 
      <h2>En testant</h2>
      <p> De plus en plus de gens essaye DScaler, pourquoi pas vous ?<br>
        Nous aimerions connaître vos impressions et les commentaires que vous 
        avez sur son utilisation. Pourquoi quelque chose fonctionne de cette manière 
        ? Quelle nouvelle fonctionnalité aimeriez vous voir apparaître etc... 
        Chaque information qui nous revient est utile. 
      <p> Jetez un oeil, avant de reporter un problème, à la liste actuelle des 
        <a href="http://sourceforge.net/mail/?group_id=7420">mailing list</a>. 
        Rappelez dans votre correspondance quel matériel vous utilisez. 
      <p> 
      <h2>En développant</h2>
      <p> Toute aide est bienvenue. Malgré la présence de partie complexes, il 
        y a un grand nombre de fonctionnalités qui peuvent être facilement implémentées 
        sans avoir besoin de connaître tous les secrets du séquencement 3:2. 
      <p> Si vous avez une idée, ou si vous voulez essayer d'implémenter quelque 
        chose qui se trouve déjà dans la <a href="../Todo.htm">liste des choses 
        à faire</a>,prenez contact avec les auteurs et rejoignez la <a href="http://sourceforge.net/mail/?group_id=7420">mailing 
        list</a> de développement de DScaler. Toutes les informations sur la <a href="developers.htm">page 
        des d&eacute;veloppeurs</a>. 
      <p> 
      <!-- #EndEditable --></td>
  </tr>
  <tr> 
    <td colspan="3">&nbsp;</td>
  </tr>
  <tr bgcolor="#FFCC00"> 
    <td colspan="3"> 
      <div align="center"><img src="../images/yellowspacer.gif" width="100%" height="2"></div>
    </td>
  </tr>
  <tr> 
    <td colspan="3">&nbsp;</td>
  </tr>
  <tr> 
    <td colspan="3"> 
      <div align="center"><a href="../index.php" class="bottommenu">home</a> | <a href="../about.htm" class="bottommenu">about</a> 
        | <a href="../Reviews.htm" class="bottommenu">reviews</a> |&nbsp;<a href="../screenshots/index.htm" class="bottommenu">screenshots</a> 
        | <a href="../downloads.htm" class="bottommenu">download</a> 
        | <a href="../Authors.htm" class="bottommenu">authors</a> 
        | <a href="../Thanks.htm" class="bottommenu">thanks</a> <br>
        <a href="../setup/index.htm" class="bottommenu">setup</a> | <a href="../keyboard.htm" class="bottommenu">keyboard 
        shortcuts </a> | <a href="http://sourceforge.net/mail/?group_id=7420" class="bottommenu">mailing 
        list</a> | <a href="../FAQ.htm" class="bottommenu">faq</a> | <a href="../developers.htm" class="bottommenu">developers</a> 
        | <a href="../Links.htm" class="bottommenu">links</a></div>
    </td>
  </tr>
</table>
<p><a href="http://sourceforge.net"><img src="http://sourceforge.net/sflogo.php?group_id=7420&type=1" border="0"
alt="SourceForge.net" align="right"></a></p>
<p>&nbsp; </p>
</body>
<!-- #EndTemplate -->
</html>
